app/views/orders/search.html.erb

  <div class="notice">
    <span> <%= @orders.count %> <%= Order.model_name.human(count: @orders.count).downcase %> <%= I18n.t(:found, count: @orders.count)%></span>
---
SELECT "orders".* FROM "orders" WHERE (code LIKE '%bi%')
SELECT COUNT(*) FROM "orders" WHERE (code LIKE '%bi%')