app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def index
    @orders = current_user.orders

SELECT "suppliers".* FROM "suppliers"
---
  def new
    @suppliers = Supplier.all

INSERT INTO "orders" ("warehouse_id", "supplier_id", "user_id", "estimated_delivery_date", "created_at", "updated_at", "code", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    order_params = params.require(:order).permit(:supplier_id, :warehouse_id, :estimated_delivery_date)
    @order = Order.new(order_params)
    @order.user = current_user
    @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."code" = ? LIMIT ?  [["code", "DLVDQ8GYSO"], ["LIMIT", 1]]
---
  def search
    @code = params["search"]
    p @code
    if @code.empty?
      flash[:notice] = 'nada'
    else
    @orders = Order.where("code LIKE ?", "%#{@code}%")

UPDATE "orders" SET "estimated_delivery_date" = ?, "updated_at" = ?, "code" = ? WHERE "orders"."id" = ?  [["estimated_delivery_date", "2024-05-10"], ["updated_at", "2022-10-04 12:15:21.191067"], ["code", "JRG5HGK1RJ"], ["id", 1]]
---
  def update
    order_params = params.require(:order).permit(:supplier_id, :warehouse_id, :estimated_delivery_date)
    @order.update(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_order_and_check_user
    @order = Order.find(params[:id])