app/controllers/product_models_controller.rb

SELECT "product_models".* FROM "product_models"
---
  def index
    @product_models = ProductModel.all

INSERT INTO "product_models" ("name", "weight", "width", "height", "depth", "sku", "supplier_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    product_model_params = params.require(:product_model).permit(:name, :weight, :width, :height,
                                                                :depth, :sku, :supplier_id)
    @product_model = ProductModel.create(product_model_params)

SELECT "suppliers".* FROM "suppliers"
---
  def new
    @product_model = ProductModel.new
    @suppliers =Supplier.all

SELECT "product_models".* FROM "product_models" WHERE "product_models"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @product_model = ProductModel.find(params[:id])