app/controllers/suppliers_controller.rb

INSERT INTO "suppliers" ("name", "company_name", "cnpj", "address", "email", "telephone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @supplier = Supplier.create(supplier_params)

SELECT "suppliers".* FROM "suppliers"
---
  def index
    @supplier = Supplier.all

UPDATE "suppliers" SET "name" = ?, "company_name" = ?, "updated_at" = ? WHERE "suppliers"."id" = ?  [["name", "BBB"], ["company_name", "bbb"], ["updated_at", "2022-09-29 12:15:56.359622"], ["id", 4]]
---
  def update
    if @supplier.update(supplier_params)

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def set_supplier
    @supplier = Supplier.find(params[:id])