app/controllers/suppliers_controller.rb

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @supplier = Supplier.find(params[:id])