app/controllers/warehouses_controller.rb

INSERT INTO "warehouses" ("name", "code", "city", "area", "created_at", "updated_at", "address", "cep", "description") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @warehouse = Warehouse.create(warehouse_params)

UPDATE "warehouses" SET "updated_at" = ?, "cep" = ? WHERE "warehouses"."id" = ?  [["updated_at", "2022-09-29 12:14:08.630059"], ["cep", "20021342"], ["id", 1]]
---
  def update
    if @warehouse.update(warehouse_params)

DELETE FROM "warehouses" WHERE "warehouses"."id" = ?  [["id", 4]]
---
  def destroy
    @warehouse.destroy